// src/data/provinces.jsx
export const provinces = [
    {
        name: 'ແຂວງຜົ້ງສາລີ',
        districts: [
            'ເມືອງຜົ້ງສາລີ', 'ເມືອງບຸນເໜືອ', 'ເມືອງບຸນໃຕ້', 'ເມືອງຍອດອູ',
            'ເມືອງຂວາ', 'ເມືອງສຳພັນ', 'ເມືອງໃໝ່'
        ]
    },
    {
        name: 'ແຂວງຫຼວງນໍ້າທາ',
        districts: [
            'ເມືອງຫຼວງນໍ້າທາ', 'ເມືອງສິງ', 'ເມືອງລອງ', 'ເມືອງວຽງພູຄາ', 'ເມືອງນາແລ'
        ]
    },
    {
        name: 'ແຂວງອຸດົມໄຊ',
        districts: [
            'ເມືອງໄຊ', 'ເມືອງຫຼາ', 'ເມືອງນາໝໍ້', 'ເມືອງງາ', 'ເມືອງແບງ',
            'ເມືອງຮຸນ', 'ເມືອງປາກແບງ'
        ]
    },
    {
        name: 'ແຂວງບໍ່ແກ້ວ',
        districts: [
            'ເມືອງຫ້ວຍຊາຍ', 'ເມືອງຕົ້ນເຜິ້ງ', 'ເມືອງເມິງ', 'ເມືອງຜາອຸດົມ', 'ເມືອງປາກທາ'
        ]
    },
    {
        name: 'ແຂວງຫຼວງພະບາງ',
        districts: [
            'ເມືອງຫຼວງພະບາງ', 'ເມືອງຊຽງເງິນ', 'ເມືອງນານ', 'ເມືອງປາກອູ', 'ເມືອງນໍ້າບາກ',
            'ເມືອງງອຍ', 'ເມືອງປາກແຊງ', 'ເມືອງໂພນໄຊ', 'ເມືອງຈອມເພັດ', 'ເມືອງວຽງຄຳ',
            'ເມືອງຜຸນຄຳ', 'ເມືອງພູຄູນ'
        ]
    },
    {
        name: 'ແຂວງຫົວພັນ',
        districts: [
            'ເມືອງຊຳເໜືອ', 'ເມືອງວຽງໄຊ', 'ເມືອງວຽງທອງ', 'ເມືອງຮ້ຽມ', 'ເມືອງຊຳໃຕ້',
            'ເມືອງຊ່ອນ', 'ເມືອງກວັນ', 'ເມືອງຊຽງຄໍ້', 'ເມືອງຮົມ', 'ເມືອງສົບເບົາ'
        ]
    },
    {
        name: 'ແຂວງໄຊຍະບູລີ',
        districts: [
            'ເມືອງໄຊຍະບູລີ', 'ເມືອງຄອບ', 'ເມືອງຫົງສາ', 'ເມືອງເງິນ', 'ເມືອງຊຽງຮ່ອນ',
            'ເມືອງພຽງ', 'ເມືອງປາກລາຍ', 'ເມືອງແກ່ນທ້າວ', 'ເມືອງບໍ່ແຕນ', 'ເມືອງທົ່ງມີໄຊ',
            'ເມືອງໄຊຊະຖານ'
        ]
    },
    {
        name: 'ນະຄອນຫຼວງວຽງຈັນ',
        districts: [
            'ເມືອງຈັນທະບູລີ', 'ເມືອງສີໂຄດຕະບອງ', 'ເມືອງໄຊເສດຖາ', 'ເມືອງສີສັດຕະນາກ',
            'ເມືອງນາຊາຍທອງ', 'ເມືອງໄຊທານີ', 'ເມືອງຫາດຊາຍຟອງ', 'ເມືອງສັງທອງ', 'ເມືອງປາກງື່ມ'
        ]
    },
    {
        name: 'ແຂວງຊຽງຂວາງ',
        districts: [
            'ເມືອງແປກ', 'ເມືອງຄຳ', 'ເມືອງໜອງແຮດ', 'ເມືອງຄູນ', 'ເມືອງໝອກໃໝ່',
            'ເມືອງພູກູດ', 'ເມືອງຜາໄຊ'
        ]
    },
    {
        name: 'ແຂວງວຽງຈັນ',
        districts: [
            'ເມືອງໂພນໂຮງ', 'ເມືອງທຸລະຄົມ', 'ເມືອງແກ້ວອຸດົມ', 'ເມືອງກາສີ', 'ເມືອງວັງວຽງ',
            'ເມືອງເຟືອງ', 'ເມືອງຊະນະຄາມ', 'ເມືອງແມດ', 'ເມືອງຫີນເຫີບ', 'ເມືອງວຽງຄຳ', 'ເມືອງໝື່ນ'
        ]
    },
    {
        name: 'ແຂວງບໍລິຄຳໄຊ',
        districts: [
            'ເມືອງປາກຊັນ', 'ເມືອງທ່າພະບາດ', 'ເມືອງປາກກະດິງ', 'ເມືອງບໍລິຄັນ', 'ເມືອງຄຳເກີດ',
            'ເມືອງວຽງທອງ', 'ເມືອງໄຊຈຳພອນ'
        ]
    },
    {
        name: 'ແຂວງຄຳມ່ວນ',
        districts: [
            'ເມືອງທ່າແຂກ', 'ເມືອງມະຫາໄຊ', 'ເມືອງນາກາຍ', 'ເມືອງຫີນບູນ', 'ເມືອງຍົມມະລາດ',
            'ເມືອງບົວລະພາ', 'ເມືອງເຊບັ້ງໄຟ', 'ເມືອງໄຊບົວທອງ', 'ເມືອງຄູນຄຳ'
        ]
    },
    {
        name: 'ແຂວງສະຫວັນນະເຂດ',
        districts: [
            'ເມືອງໄກສອນພົມວິຫານ', 'ເມືອງອຸທຸມພອນ', 'ເມືອງອາດສະພັງທອງ', 'ເມືອງພິນ', 'ເມືອງເຊໂປນ',
            'ເມືອງນອງ', 'ເມືອງທ່າປາງທອງ', 'ເມືອງສອງຄອນ', 'ເມືອງຈຳພອນ', 'ເມືອງຊົນນະບູລີ',
            'ເມືອງໄຊບູລີ', 'ເມືອງວິລະບູລີ', 'ເມືອງອາດສະພອນ', 'ເມືອງໄຊພູທອງ', 'ເມືອງພະລານໄຊ'
        ]
    },
    {
        name: 'ແຂວງສາລະວັນ',
        districts: [
            'ເມືອງສາລະວັນ', 'ເມືອງຕະໂອ້ຍ', 'ເມືອງຕຸ້ມລານ', 'ເມືອງລະຄອນເພງ', 'ເມືອງວາປີ',
            'ເມືອງຄົງເຊໂດນ', 'ເມືອງເລົ່າງາມ', 'ເມືອງສະໝ້ວຍ'
        ]
    },
    {
        name: 'ແຂວງເຊກອງ',
        districts: [
            'ເມືອງລະມາມ', 'ເມືອງກະລຶມ', 'ເມືອງດາກຈຶງ', 'ເມືອງທ່າແຕງ'
        ]
    },
    {
        name: 'ແຂວງຈຳປາສັກ',
        districts: [
            'ເມືອງປາກເຊ', 'ເມືອງຊະນະສົມບູນ', 'ເມືອງບາຈຽງຈະເລີນສຸກ', 'ເມືອງປາກຊ່ອງ', 'ເມືອງປະທຸມພອນ',
            'ເມືອງໂພນທອງ', 'ເມືອງຈຳປາສັກ', 'ເມືອງສຸຂຸມາ', 'ເມືອງມູນລະປະໂມກ', 'ເມືອງໂຂງ'
        ]
    },
    {
        name: 'ແຂວງອັດຕະປື',
        districts: [
            'ເມືອງໄຊເສດຖາ', 'ເມືອງສາມັກຄີໄຊ', 'ເມືອງສະໜາມໄຊ', 'ເມືອງຊານໄຊ', 'ເມືອງພູວົງ'
        ]
    }
];